Repository: tacshi/SelectionBar
Catalog: Sources/SelectionBarApp/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: Enable
ja: 有効にする
zh_hans: 启用
zh_hant: 啟用

source: Disable
ja: 無効にする
zh_hans: 停用
zh_hant: 停用

source: Settings
ja: 設定
zh_hans: 设置
zh_hant: 設定

source: Check for Updates...
ja: アップデートを確認…
zh_hans: 检查更新…
zh_hant: 檢查更新…

source: Quit
ja: 終了
zh_hans: 退出
zh_hant: 結束

source: General
ja: 一般
zh_hans: 通用
zh_hant: 一般

source: Actions
ja: アクション
zh_hans: 操作
zh_hant: 操作

source: Providers
ja: プロバイダ
zh_hans: 服务商
zh_hant: 服務供應商

source: Enable selection bar
ja: セレクションバーを有効にする
zh_hans: 启用选择栏
zh_hant: 啟用選取工具列

source: Show a floating toolbar when text is selected in any app
ja: テキスト選択時にフローティングツールバーを表示
zh_hans: 在任何应用中选择文本时显示浮动工具栏
zh_hant: 在任何應用程式中選取文字時顯示浮動工具列

source: Activation
ja: 起動
zh_hans: 激活
zh_hant: 啟動方式

source: Enable Do Not Disturb Mode
ja: おやすみモードを有効にする
zh_hans: 启用免打扰模式
zh_hant: 啟用勿擾模式

source: Hold Key
ja: 長押しキー
zh_hans: 按住键
zh_hant: 按住按鍵

source: When enabled, select text, then hold the selected key to show Selection Bar.
ja: 有効時、テキストを選択してから指定したキーを押し続けると、Selection Bar が表示されます。
zh_hans: 启用后，先选择文本，再按住所选按键以显示选择栏。
zh_hant: 啟用後，先選取文字，再按住所選按鍵以顯示選取工具列。

source: Language
ja: 言語
zh_hans: 语言
zh_hant: 語言

source: System Default
ja: システムデフォルト
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: Restart Required
ja: 再起動が必要
zh_hans: 需要重启
zh_hant: 需要重新啟動

source: The language change will take effect after restarting SelectionBar.
ja: 言語の変更はSelectionBarを再起動した後に有効になります。
zh_hans: 语言更改将在重启SelectionBar后生效。
zh_hant: 重新啟動 SelectionBar 後，語言變更才會生效。

source: Restart Now
ja: 今すぐ再起動
zh_hans: 立即重启
zh_hant: 立即重新啟動

source: Launch at Login
ja: ログイン時に起動
zh_hans: 登录时启动
zh_hant: 登入時啟動

source: Later
ja: 後で
zh_hans: 稍后
zh_hant: 稍後

source: Ignored Apps
ja: 除外アプリ
zh_hans: 忽略的应用
zh_hant: 忽略的應用程式

source: No ignored apps
ja: 無視するアプリなし
zh_hans: 无忽略的应用
zh_hant: 沒有忽略的應用程式

source: Included Apps
ja: 含めるアプリ
zh_hans: 包含的应用
zh_hant: 包含的應用程式

source: No included apps
ja: 含めるアプリなし
zh_hans: 没有包含的应用
zh_hant: 沒有包含的應用程式

source: Remove
ja: 削除
zh_hans: 移除
zh_hant: 移除

source: Add Application
ja: アプリを追加
zh_hans: 添加应用
zh_hant: 加入應用程式

source: The selection bar won't appear when these apps are in the foreground.
ja: これらのアプリが前面にある場合、セレクションバーは表示されません。
zh_hans: 当这些应用在前台时，选择栏不会显示。
zh_hant: 這些應用程式在前景執行時，不會顯示選取工具列。

source: Use this for apps where text selection works with Cmd+C but Accessibility does not expose selected text directly. SelectionBar will allow a stricter clipboard fallback for these apps. Known apps such as WeChat and Telegram are only prefilled when they are installed.
ja: テキスト選択は Cmd+C でコピーできるものの、アクセシビリティでは選択テキストが直接取得できないアプリ向けです。これらのアプリでは、SelectionBar がより厳格なクリップボードフォールバックを許可します。WeChat や Telegram などの既知のアプリは、インストールされている場合のみ事前入力されます。
zh_hans: 用于那些文本选择可通过 Cmd+C 复制，但辅助功能不会直接暴露所选文本的应用。对于这些应用，SelectionBar 会启用更严格的剪贴板回退。像 WeChat 和 Telegram 这样的已知应用仅会在已安装时预填。
zh_hant: 適用於可透過 Cmd+C 複製選取文字，但「輔助使用」無法直接讀取選取內容的應用程式。SelectionBar 會在更嚴格的條件下透過剪貼簿讀取這些應用程式的選取文字。WeChat、Telegram 等已知應用程式只會在已安裝時預先加入。

source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Choose Applications
ja: アプリを選択
zh_hans: 选择应用
zh_hant: 選擇應用程式

source: Add
ja: 追加
zh_hans: 添加
zh_hant: 加入

source: Search
ja: 検索
zh_hans: 搜索
zh_hant: 搜尋

source: Built-in
ja: 組み込み
zh_hans: 内置
zh_hant: 內建

source: Custom
ja: カスタム
zh_hans: 自定义
zh_hant: 自訂

source: Engine
ja: エンジン
zh_hans: 引擎
zh_hant: 引擎

source: Web Search
ja: Web検索
zh_hans: 网页搜索
zh_hant: 網頁搜尋

source: Run Command
ja: コマンドを実行
zh_hans: 运行命令
zh_hant: 執行指令

source: Terminal
ja: ターミナル
zh_hans: 终端
zh_hant: 終端機

source: No supported terminal apps detected
ja: 対応しているターミナルアプリが見つかりません
zh_hans: 未检测到受支持的终端应用
zh_hant: 未偵測到支援的終端機應用程式

source: Runs the selected command in the chosen terminal when the executable exists.
ja: 実行ファイルが存在する場合、選択したコマンドを指定したターミナルで実行します。
zh_hans: 当可执行文件存在时，在所选终端中运行选中的命令。
zh_hant: 可執行檔存在時，會在所選終端機中執行選取的指令。

source: Enable Look Up
ja: 辞書を有効にする
zh_hans: 启用查询
zh_hant: 啟用查詢

source: Word Lookup
ja: 辞書検索
zh_hans: 查词
zh_hant: 查字詞

source: Dictionary
ja: 辞書
zh_hans: 词典
zh_hant: 辭典

source: Dictionary (macOS)
ja: 辞書（macOS）
zh_hans: 词典（macOS）
zh_hant: 辭典（macOS）

source: Custom Search
ja: カスタム検索
zh_hans: 自定义搜索
zh_hant: 自訂搜尋

source: Enter a URL scheme (e.g. myapp) or a full URL with {{query}}.
ja: URLスキーム（例: myapp）または{{query}}を含む完全なURLを入力してください。
zh_hans: 输入URL Scheme（如myapp）或包含{{query}}的完整URL。
zh_hant: 輸入 URL Scheme（例如 myapp），或包含 {{query}} 的完整網址。

source: Enable Translate
ja: 翻訳を有効にする
zh_hans: 启用翻译
zh_hant: 啟用翻譯

source: Translation
ja: 翻訳
zh_hans: 翻译
zh_hant: 翻譯

source: Provider
ja: プロバイダ
zh_hans: 服务商
zh_hant: 服務供應商

source: No translation providers configured
ja: 翻訳プロバイダが未設定
zh_hans: 未配置翻译服务商
zh_hant: 尚未設定翻譯服務供應商

source: Target
ja: ターゲット
zh_hans: 目标
zh_hant: 目標語言

source: Translate supports app providers and LLM providers. Target applies to LLM providers.
ja: アプリとLLMプロバイダに対応。ターゲットはLLMに適用。
zh_hans: 支持应用和LLM服务商。目标语言仅适用于LLM服务商。
zh_hant: 翻譯支援應用程式與 LLM 服務供應商。目標語言適用於 LLM 服務供應商。

source: Enable Speak
ja: 読み上げを有効にする
zh_hans: 启用朗读
zh_hant: 啟用朗讀

source: Voice
ja: 音声
zh_hans: 语音
zh_hant: 聲音

source: Speak
ja: 読み上げ
zh_hans: 朗读
zh_hant: 朗讀

source: Reads selected text aloud using the chosen provider and voice.
ja: 選択したプロバイダと音声でテキストを読み上げます。
zh_hans: 使用所选服务商和语音朗读选中的文本。
zh_hant: 使用所選服務供應商與聲音朗讀選取的文字。

source: Enable Chat
ja: チャットを有効にする
zh_hans: 启用聊天
zh_hant: 啟用對話

source: Chat with AI about selected text using streaming responses.
ja: ストリーミング応答で選択テキストについてAIとチャット。
zh_hans: 使用流式响应与AI聊天讨论选中的文本。
zh_hant: 與 AI 討論選取的文字，回覆會逐步顯示。

source: No LLM providers configured. Add an API key in Providers.
ja: LLMプロバイダが未設定。プロバイダでAPIキーを追加してください。
zh_hans: 未配置LLM服务商。请在服务商中添加API密钥。
zh_hant: 尚未設定 LLM 服務供應商。請在「服務供應商」中加入 API 金鑰。

source: No actions configured
ja: アクションが未設定
zh_hans: 未配置操作
zh_hant: 尚未設定操作

source: Add Action
ja: アクションを追加
zh_hans: 添加操作
zh_hant: 加入操作

source: Enabled actions appear in Selection Bar actions. Drag to reorder enabled actions.
ja: 有効なアクションはセレクションバーに表示。ドラッグで並べ替え。
zh_hans: 已启用的操作会显示在选择栏中。拖拽可重新排序。
zh_hant: 已啟用的操作會顯示在選取工具列中。拖移可調整順序。

source: Choose provider before enabling
ja: 有効にする前にプロバイダを選択
zh_hans: 启用前请先选择服务商
zh_hant: 啟用前請先選擇服務供應商

source: Choose model before enabling
ja: 有効にする前にモデルを選択
zh_hans: 启用前请先选择模型
zh_hant: 啟用前請先選擇模型

source: Provider key missing
ja: プロバイダキーなし
zh_hans: 缺少服务商密钥
zh_hant: 缺少服務供應商金鑰

source: JavaScript • Inplace Edit
ja: JavaScript・インプレース編集
zh_hans: JavaScript · 原位编辑
zh_hant: JavaScript · 就地編輯

source: JavaScript • Result Window
ja: JavaScript・結果ウィンドウ
zh_hans: JavaScript · 结果窗口
zh_hant: JavaScript · 結果視窗

source: New Action
ja: 新規アクション
zh_hans: 新建操作
zh_hant: 新增操作

source: Edit Action
ja: アクション編集
zh_hans: 编辑操作
zh_hant: 編輯操作

source: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Action Name
ja: アクション名
zh_hans: 操作名称
zh_hant: 操作名稱

source: Icon
ja: アイコン
zh_hans: 图标
zh_hant: 圖示

source: Pick SF Symbol
ja: SFシンボルを選択
zh_hans: 选择SF符号
zh_hant: 選擇 SF Symbol

source: Execution
ja: 実行
zh_hans: 执行
zh_hant: 執行

source: Kind
ja: 種類
zh_hans: 类型
zh_hant: 類型

source: Output
ja: 出力
zh_hans: 输出
zh_hant: 輸出

source: Model
ja: モデル
zh_hans: 模型
zh_hant: 模型

source: Select
ja: 選択
zh_hans: 选择
zh_hant: 選擇

source: No configured providers. Configure a provider in the Providers tab.
ja: プロバイダ未設定。プロバイダタブで設定してください。
zh_hans: 未配置服务商。请在服务商标签页中配置。
zh_hant: 尚未設定服務供應商。請在「服務供應商」分頁中設定。

source: Context
ja: コンテキスト
zh_hans: 上下文
zh_hant: 上下文

source: Include Source Context
ja: ソースコンテキストを含める
zh_hans: 包含源上下文
zh_hant: 包含來源內容

source: When enabled, this action reads a bounded excerpt around the selection from the current file, PDF, or web page.
ja: 有効にすると、このアクションは現在のファイル、PDF、またはWebページから選択範囲周辺の範囲限定の抜粋を読み取ります。
zh_hans: 启用后，此操作会从当前文件、PDF 或网页中读取选区周围的限定长度摘录。
zh_hant: 啟用後，此操作會從目前的檔案、PDF 或網頁讀取選取文字前後的內容，並限制讀取長度。

source: Prompt Template
ja: プロンプトテンプレート
zh_hans: 提示词模板
zh_hant: 提示詞範本

source: Use {{TEXT}} for the selected text. Source context actions can also use {{CONTEXT}}, {{SOURCE_URL}}, {{APP_NAME}}, and {{BUNDLE_ID}}.
ja: {{TEXT}}を選択テキストに使用します。ソースコンテキストアクションでは{{CONTEXT}}、{{SOURCE_URL}}、{{APP_NAME}}、{{BUNDLE_ID}}も使用できます。
zh_hans: 使用{{TEXT}}表示选中文本。源上下文操作还可以使用{{CONTEXT}}、{{SOURCE_URL}}、{{APP_NAME}}和{{BUNDLE_ID}}。
zh_hant: 使用 {{TEXT}} 代表選取的文字。包含來源內容的操作還可使用 {{CONTEXT}}、{{SOURCE_URL}}、{{APP_NAME}} 和 {{BUNDLE_ID}}。

source: Define transform(input) to return a string or async Promise<string>. Use await fetch(...) for HTTP/HTTPS requests.
ja: 文字列または非同期のPromise<string>を返すtransform(input)を定義してください。HTTP/HTTPSリクエストにはawait fetch(...)を使用できます。
zh_hans: 定义返回字符串或异步 Promise<string> 的 transform(input)。使用 await fetch(...) 发起 HTTP/HTTPS 请求。
zh_hant: 定義 transform(input)，回傳字串或非同步的 Promise<string>。使用 await fetch(...) 發出 HTTP/HTTPS 請求。

source: LLM Prompt (Optional, unused for JavaScript)
ja: LLMプロンプト（任意、JavaScriptでは不使用）
zh_hans: LLM提示词（可选，JavaScript模式下不使用）
zh_hant: LLM 提示詞（選填，JavaScript 不使用）

source: This is kept so switching back to LLM preserves your previous prompt.
ja: LLMモードに切り替えた際にプロンプトが保持されます。
zh_hans: 保留此项，切换回LLM时可保留之前的提示词。
zh_hant: 保留此欄位，以便切換回 LLM 時繼續使用先前的提示詞。

source: Search symbols
ja: シンボルを検索
zh_hans: 搜索符号
zh_hant: 搜尋符號

source: Custom Providers
ja: カスタムプロバイダ
zh_hans: 自定义服务商
zh_hant: 自訂服務供應商

source: Add Provider
ja: プロバイダを追加
zh_hans: 添加服务商
zh_hant: 加入服務供應商

source: Provider Not Found
ja: プロバイダが見つかりません
zh_hans: 未找到服务商
zh_hant: 找不到服務供應商

source: This provider no longer exists.
ja: このプロバイダは存在しません。
zh_hans: 此服务商已不存在。
zh_hant: 此服務供應商已不存在。

source: Select a Provider
ja: プロバイダを選択
zh_hans: 选择服务商
zh_hant: 選擇服務供應商

source: Choose a provider from the sidebar.
ja: サイドバーからプロバイダを選択してください。
zh_hans: 从侧边栏选择一个服务商。
zh_hant: 從側邊欄選擇服務供應商。

source: Capabilities
ja: 機能
zh_hans: 功能
zh_hant: 功能

source: Chat Model
ja: チャットモデル
zh_hans: 对话模型
zh_hant: 對話模型

source: Translation Model
ja: 翻訳モデル
zh_hans: 翻译模型
zh_hant: 翻譯模型

source: Uses chat model
ja: チャットモデルを使用
zh_hans: 使用对话模型
zh_hant: 使用對話模型

source: Test connection first
ja: 先に接続テスト
zh_hans: 请先测试连接
zh_hant: 請先測試連線

source: OpenAI supports both LLM chat and translation. You can choose separate models.
ja: OpenAIはチャットと翻訳に対応。別々のモデルを選択可能。
zh_hans: OpenAI支持对话和翻译，可选择不同模型。
zh_hant: OpenAI 支援 LLM 對話與翻譯，可分別選擇模型。

source: Get API Key from OpenAI
ja: OpenAIのAPIキーを取得
zh_hans: 获取OpenAI API密钥
zh_hant: 取得 OpenAI API 金鑰

source: Select OpenAI Chat Model
ja: OpenAIチャットモデルを選択
zh_hans: 选择OpenAI对话模型
zh_hant: 選擇 OpenAI 對話模型

source: Select OpenAI Translation Model
ja: OpenAI翻訳モデルを選択
zh_hans: 选择OpenAI翻译模型
zh_hant: 選擇 OpenAI 翻譯模型

source: OpenRouter supports unified LLM chat and translation model routing. You can choose separate models.
ja: OpenRouterはチャットと翻訳のモデルルーティングに対応。別々のモデルを選択可能。
zh_hans: OpenRouter支持对话和翻译模型路由，可选择不同模型。
zh_hant: OpenRouter 支援統一的 LLM 對話與翻譯模型路由，可分別選擇模型。

source: Get API Key from OpenRouter
ja: OpenRouterのAPIキーを取得
zh_hans: 获取OpenRouter API密钥
zh_hant: 取得 OpenRouter API 金鑰

source: Select OpenRouter Chat Model
ja: OpenRouterチャットモデルを選択
zh_hans: 选择OpenRouter对话模型
zh_hant: 選擇 OpenRouter 對話模型

source: Select OpenRouter Translation Model
ja: OpenRouter翻訳モデルを選択
zh_hans: 选择OpenRouter翻译模型
zh_hant: 選擇 OpenRouter 翻譯模型

source: DeepL is translation-only. Chat capability is intentionally disabled.
ja: DeepLは翻訳専用です。チャット機能は無効。
zh_hans: DeepL仅用于翻译，对话功能已禁用。
zh_hant: DeepL 僅提供翻譯，不支援對話。

source: No chat capability
ja: チャット機能なし
zh_hans: 无对话功能
zh_hant: 不支援對話

source: ElevenLabs is a TTS-only provider for high-quality text-to-speech.
ja: ElevenLabsは高品質テキスト読み上げ専用プロバイダです。
zh_hans: ElevenLabs是仅用于高品质文字转语音的服务商。
zh_hant: ElevenLabs 僅提供文字轉語音服務。

source: Get API Key from ElevenLabs
ja: ElevenLabsのAPIキーを取得
zh_hans: 获取ElevenLabs API密钥
zh_hant: 取得 ElevenLabs API 金鑰

source: No voices available. Save your API key and test the connection.
ja: 音声が利用できません。APIキーを保存して接続テストを行ってください。
zh_hans: 暂无可用语音。请保存API密钥并测试连接。
zh_hant: 沒有可用的聲音。請儲存 API 金鑰並測試連線。

source: Custom Provider
ja: カスタムプロバイダ
zh_hans: 自定义服务商
zh_hant: 自訂服務供應商

source: OpenAI-compatible custom provider
ja: OpenAI互換カスタムプロバイダ
zh_hans: OpenAI兼容的自定义服务商
zh_hant: 相容於 OpenAI 的自訂服務供應商

source: Edit
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Delete Provider?
ja: プロバイダを削除？
zh_hans: 删除服务商？
zh_hant: 刪除服務供應商？

source: This provider and its API key will be removed.
ja: このプロバイダとAPIキーが削除されます。
zh_hans: 此服务商及其API密钥将被移除。
zh_hant: 將移除此服務供應商及其 API 金鑰。

source: Chat
ja: チャット
zh_hans: 对话
zh_hant: 對話

source: Enabled
ja: 有効
zh_hans: 已启用
zh_hant: 已啟用

source: Disabled
ja: 無効
zh_hans: 已停用
zh_hant: 已停用

source: Base URL
ja: ベースURL
zh_hans: 基础URL
zh_hant: 基礎網址

source: Available Models
ja: 利用可能なモデル
zh_hans: 可用模型
zh_hant: 可用模型

source: Custom Action
ja: カスタムアクション
zh_hans: 自定义操作
zh_hant: 自訂操作

source: SF Symbol Name
ja: SF Symbolの名前
zh_hans: SF Symbol 名称
zh_hant: SF Symbol 名稱

source: Translate
ja: 翻訳
zh_hans: 翻译
zh_hant: 翻譯

source: Success! Found %lld models.
ja: 成功！%lld 個のモデルが見つかりました。
zh_hans: 成功！找到 %lld 个模型。
zh_hant: 已找到 %lld 個模型。

source: Connected! Found %lld models
ja: 接続成功！%lld 個のモデルが見つかりました
zh_hans: 连接成功！找到 %lld 个模型
zh_hant: 已連線，找到 %lld 個模型

source: ... and %lld more
ja: …他 %lld 個
zh_hans: …还有 %lld 个
zh_hant: …還有 %lld 個

source: %lld of %lld models
ja: %1$lld / %2$lld モデル
zh_hans: %1$lld / %2$lld 个模型
zh_hant: %1$lld / %2$lld 個模型

source: %lld models
ja: %lld 個のモデル
zh_hans: %lld 个模型
zh_hant: %lld 個模型

source: Credentials
ja: 認証情報
zh_hans: 凭据
zh_hant: 憑證

source: API Key
ja: APIキー
zh_hans: API密钥
zh_hant: API 金鑰

source: Test Connection
ja: 接続テスト
zh_hans: 测试连接
zh_hant: 測試連線

source: Save Key
ja: キーを保存
zh_hans: 保存密钥
zh_hant: 儲存金鑰

source: Clear Key
ja: キーを削除
zh_hans: 清除密钥
zh_hant: 清除金鑰

source: Select Model
ja: モデルを選択
zh_hans: 选择模型
zh_hant: 選擇模型

source: Clear Selection
ja: 選択を解除
zh_hans: 清除选择
zh_hant: 清除選擇

source: Search models...
ja: モデルを検索...
zh_hans: 搜索模型...
zh_hant: 搜尋模型…

source: Use Chat Model
ja: チャットモデルを使用
zh_hans: 使用对话模型
zh_hant: 使用對話模型

source: Edit Provider
ja: プロバイダを編集
zh_hans: 编辑服务商
zh_hant: 編輯服務供應商

source: Add Custom Provider
ja: カスタムプロバイダを追加
zh_hans: 添加自定义服务商
zh_hant: 加入自訂服務供應商

source: Quick Setup
ja: クイックセットアップ
zh_hans: 快速设置
zh_hant: 快速設定

source: Provider Template
ja: プロバイダテンプレート
zh_hans: 服务商模板
zh_hant: 服務供應商範本

source: Popular
ja: 人気
zh_hans: 热门
zh_hant: 熱門

source: Local
ja: ローカル
zh_hans: 本地
zh_hant: 本機

source: Other
ja: その他
zh_hans: 其他
zh_hant: 其他

source: Provider Details
ja: プロバイダ詳細
zh_hans: 服务商详情
zh_hant: 服務供應商詳細資訊

source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

source: Display name (e.g., 'Volcengine Doubao', 'Together AI')
ja: 表示名（例：'Volcengine Doubao'、'Together AI'）
zh_hans: 显示名称（如'Volcengine Doubao'、'Together AI'）
zh_hant: 顯示名稱（例如「Volcengine Doubao」、「Together AI」）

source: API endpoint (e.g., https://api.together.xyz/v1)
ja: APIエンドポイント（例：https://api.together.xyz/v1）
zh_hans: API端点（如 https://api.together.xyz/v1）
zh_hant: API 端點（例如 https://api.together.xyz/v1）

source: Please enter a valid URL starting with http:// or https://
ja: http://またはhttps://で始まる有効なURLを入力してください
zh_hans: 请输入以http://或https://开头的有效URL
zh_hant: 請輸入以 http:// 或 https:// 開頭的有效網址

source: Authentication
ja: 認証
zh_hans: 认证
zh_hant: 驗證

source: No API key required for local providers
ja: ローカルプロバイダはAPIキー不要
zh_hans: 本地服务商无需API密钥
zh_hant: 本機服務供應商不需要 API 金鑰

source: Test connection to enable capabilities
ja: 接続テストで機能を有効化
zh_hans: 测试连接以启用功能
zh_hant: 測試連線以啟用功能

source: LLM (Chat)
ja: LLM（チャット）
zh_hans: LLM（对话）
zh_hant: LLM（對話）

source: Select LLM model
ja: LLMモデルを選択
zh_hans: 选择LLM模型
zh_hant: 選擇 LLM 模型

source: Select translation model
ja: 翻訳モデルを選択
zh_hans: 选择翻译模型
zh_hant: 選擇翻譯模型

source: Use your endpoint ID as the model name
ja: エンドポイントIDをモデル名として使用
zh_hans: 使用端点ID作为模型名称
zh_hant: 使用端點 ID 作為模型名稱

source: Start LM Studio with server mode enabled
ja: LM Studioをサーバーモードで起動してください
zh_hans: 请在服务器模式下启动LM Studio
zh_hant: 請以伺服器模式啟動 LM Studio

source: Requires Ollama running locally
ja: ローカルでOllamaが実行中である必要があります
zh_hans: 需要本地运行Ollama
zh_hant: 需要在本機執行 Ollama

source: LM Studio (Local)
ja: LM Studio（ローカル）
zh_hans: LM Studio（本地）
zh_hant: LM Studio（本機）

source: Ollama OpenAI API (Local)
ja: Ollama OpenAI API（ローカル）
zh_hans: Ollama OpenAI API（本地）
zh_hant: Ollama OpenAI API（本機）

source: Key saved to Keychain.
ja: キーチェーンに保存しました。
zh_hans: 已保存到钥匙串。
zh_hant: 金鑰已儲存至鑰匙圈。

source: Key cleared from Keychain.
ja: キーチェーンから削除しました。
zh_hans: 已从钥匙串清除。
zh_hant: 金鑰已從鑰匙圈移除。

source: Key cleared.
ja: キーを削除しました。
zh_hans: 已清除密钥。
zh_hant: 已清除金鑰。

source: Text-to-Speech
ja: テキスト読み上げ
zh_hans: 文字转语音
zh_hant: 文字轉語音

source: Select TTS model
ja: TTSモデルを選択
zh_hans: 选择TTS模型
zh_hant: 選擇 TTS 模型

source: Chat Sessions
ja: チャットセッション
zh_hans: 聊天会话
zh_hant: 對話記錄

source: Session Limit
ja: セッション上限
zh_hans: 会话上限
zh_hant: 對話數量上限

source: Clear All Sessions
ja: すべてのセッションを削除
zh_hans: 清除所有会话
zh_hant: 清除所有對話

source: Clear All Sessions?
ja: すべてのセッションを削除しますか？
zh_hans: 清除所有会话？
zh_hant: 清除所有對話？

source: Clear All
ja: すべて削除
zh_hans: 全部清除
zh_hant: 全部清除

source: No saved sessions
ja: 保存されたセッションなし
zh_hans: 无已保存的会话
zh_hant: 沒有已儲存的對話

source: Key Binding
ja: キー割り当て
zh_hans: 快捷键
zh_hant: 快速鍵

source: Key Bindings
ja: キー割り当て
zh_hans: 快捷键
zh_hant: 快速鍵

source: Add Key Binding
ja: キー割り当てを追加
zh_hans: 添加快捷键
zh_hant: 加入快速鍵

source: No key bindings configured
ja: キー割り当てが未設定
zh_hans: 未配置快捷键
zh_hant: 尚未設定快速鍵

source: Enabled key bindings appear before custom actions in Selection Bar.
ja: 有効なキー割り当てはカスタムアクションより前に表示されます。
zh_hans: 已启用的快捷键会在选择栏中显示在自定义操作之前。
zh_hant: 已啟用的快速鍵會顯示在選取工具列的自訂操作之前。

source: Key Binding • %@
ja: キー割り当て・%@
zh_hans: 快捷键 · %@
zh_hant: 快速鍵 · %@

source: Key Binding • Invalid Shortcut
ja: キー割り当て・無効なショートカット
zh_hans: 快捷键 · 无效快捷键
zh_hant: 快速鍵 · 無效的快速鍵

source: Shortcut (e.g. cmd+b)
ja: ショートカット（例: cmd+b）
zh_hans: 快捷键（如 cmd+b）
zh_hant: 快速鍵（例如 cmd+b）

source: Shortcut
ja: ショートカット
zh_hans: 快捷键
zh_hant: 快速鍵

source: Press Shortcut
ja: ショートカットを押してください
zh_hans: 按下快捷键
zh_hant: 按下快速鍵

source: Record Shortcut
ja: ショートカットを記録
zh_hans: 录制快捷键
zh_hant: 錄製快速鍵

source: App Overrides
ja: アプリ別設定
zh_hans: 应用覆盖
zh_hant: 個別應用程式設定

source: No app overrides configured
ja: アプリ別設定はありません
zh_hans: 尚未配置应用覆盖
zh_hant: 尚未設定個別應用程式

source: Add App Override
ja: アプリ別設定を追加
zh_hans: 添加应用覆盖
zh_hant: 加入應用程式設定

source: Will send: %@
ja: 送信内容: %@
zh_hans: 将发送：%@
zh_hant: 將傳送：%@

source: Use per-app shortcuts when apps require different bindings.
ja: アプリごとに異なるショートカットが必要な場合は、アプリ別ショートカットを使用します。
zh_hans: 当不同应用需要不同绑定时，使用按应用区分的快捷键。
zh_hant: 不同應用程式需要不同的快速鍵時，可分別設定。

source: Use format like cmd+b, cmd+shift+k, or ctrl+opt+return.
ja: cmd+b、cmd+shift+k、ctrl+opt+return の形式で入力してください。
zh_hans: 请使用如 cmd+b、cmd+shift+k 或 ctrl+opt+return 的格式。
zh_hant: 請使用 cmd+b、cmd+shift+k 或 ctrl+opt+return 等格式。

source: Permissions
ja: 権限
zh_hans: 权限
zh_hant: 權限

source: SelectionBar needs Accessibility to read selected text and Input Monitoring to observe global mouse and keyboard events.
ja: SelectionBarは、選択テキストを読み取るためにアクセシビリティ、グローバルなマウスとキーボードのイベントを監視するために入力監視の権限が必要です。
zh_hans: SelectionBar 需要“辅助功能”权限来读取选中文本，需要“输入监控”权限来监听全局鼠标和键盘事件。
zh_hant: SelectionBar 需要「輔助使用」權限來讀取選取的文字，並需要「輸入監控」權限來偵測全系統的滑鼠與鍵盤事件。

source: Granted
ja: 許可済み
zh_hans: 已授权
zh_hant: 已授權

source: Grant
ja: 許可する
zh_hans: 去授权
zh_hant: 授權

source: Open
ja: 開く
zh_hans: 打开
zh_hant: 開啟

source: Checking...
ja: 確認中...
zh_hans: 检查中...
zh_hant: 正在檢查…

source: Custom URL Scheme
ja: カスタムURLスキーム
zh_hans: 自定义 URL Scheme
zh_hant: 自訂 URL Scheme

source: URL Scheme
ja: URLスキーム

source: Enter a scheme like eudic, or a URL template with {{query}}.
ja: eudicのようなスキーム、または{{query}}を含むURLテンプレートを入力してください。
zh_hans: 输入类似 eudic 的 Scheme，或包含 {{query}} 的 URL 模板。
zh_hant: 輸入 eudic 等 Scheme，或包含 {{query}} 的網址範本。

source: Profiles
ja: プロファイル
zh_hans: 配置方案
zh_hant: 設定方案

source: No profiles configured
ja: プロファイルが未設定
zh_hans: 未配置方案
zh_hant: 尚未建立設定方案

source: Add Profile
ja: プロファイルを追加
zh_hans: 添加方案
zh_hant: 加入方案

source: A matching enabled profile replaces the global action list for that app.
ja: 一致する有効なプロファイルは、そのアプリのグローバルなアクション一覧を置き換えます。
zh_hans: 匹配的已启用方案会替换该应用的全局操作列表。
zh_hant: 符合條件且已啟用的方案會取代該應用程式的全域操作列表。

source: New Profile
ja: 新規プロファイル
zh_hans: 新建方案
zh_hant: 新增方案

source: Edit Profile
ja: プロファイルを編集
zh_hans: 编辑方案
zh_hant: 編輯方案

source: No application selected
ja: アプリケーションが未選択
zh_hans: 未选择应用
zh_hant: 尚未選擇應用程式

source: Choose App
ja: アプリを選択
zh_hans: 选择应用
zh_hant: 選擇應用程式

source: Change App
ja: アプリを変更
zh_hans: 更改应用
zh_hant: 更換應用程式

source: A profile already exists for this application.
ja: このアプリケーションのプロファイルはすでに存在します。
zh_hans: 该应用已存在配置方案。
zh_hant: 此應用程式已有設定方案。

source: Enable Profile
ja: プロファイルを有効にする
zh_hans: 启用方案
zh_hant: 啟用方案

source: Application
ja: アプリケーション
zh_hans: 应用
zh_hant: 應用程式

source: These actions replace the global configured action list for the selected app.
ja: これらのアクションは、選択したアプリのグローバル設定のアクション一覧を置き換えます。
zh_hans: 这些操作会替换所选应用的全局操作列表。
zh_hant: 這些操作會取代所選應用程式的全域操作列表。

source: %d actions
ja: %d 個のアクション
zh_hans: %d 个操作
zh_hant: %d 個操作

source: %d missing
ja: 欠落 %d 件
zh_hans: %d 个缺失
zh_hant: 缺少 %d 個

source: %d invalid
ja: 無効 %d 件
zh_hans: %d 个无效
zh_hant: %d 個無效

source: Pipeline
ja: パイプライン
zh_hans: 流水线
zh_hant: 處理流程

source: Add Step
ja: ステップを追加
zh_hans: 添加步骤
zh_hant: 加入步驟

source: No steps configured
ja: ステップが未設定
zh_hans: 未配置步骤
zh_hant: 尚未設定步驟

source: Create a JavaScript or LLM action first.
ja: 先にJavaScriptまたはLLMのアクションを作成してください。
zh_hans: 请先创建 JavaScript 或 LLM 操作。
zh_hant: 請先建立 JavaScript 或 LLM 操作。

source: Missing Action
ja: アクションが見つかりません
zh_hans: 操作缺失
zh_hant: 找不到操作

source: Missing
ja: 欠落
zh_hans: 缺失
zh_hant: 缺少

source: Move Up
ja: 上へ移動
zh_hans: 上移
zh_hant: 上移

source: Move Down
ja: 下へ移動
zh_hans: 下移
zh_hant: 下移

source: Invalid action
ja: 無効なアクション
zh_hans: 无效操作
zh_hant: 無效的操作

source: Pipeline • %d steps
ja: パイプライン・%d ステップ
zh_hans: 流水线 · %d 个步骤
zh_hant: 處理流程 · %d 個步驟

source: Pipeline needs at least one step
ja: パイプラインには少なくとも1つのステップが必要です
zh_hans: 流水线至少需要一个步骤
zh_hant: 處理流程至少需要一個步驟

source: Pipeline has a missing step
ja: パイプラインに見つからないステップがあります
zh_hans: 流水线中有缺失的步骤
zh_hant: 處理流程中有缺少的步驟

source: Pipeline has an invalid step
ja: パイプラインに無効なステップがあります
zh_hans: 流水线中有无效的步骤
zh_hant: 處理流程中有無效的步驟

source: Pipeline has an invalid LLM step
ja: パイプラインに無効なLLMステップがあります
zh_hans: 流水线中有无效的 LLM 步骤
zh_hant: 處理流程中有無效的 LLM 步驟

source: Success! Found %lld voices.
ja: 成功！%lld 個の音声が見つかりました。
zh_hans: 成功！找到 %lld 个语音。
zh_hant: 已找到 %lld 種聲音。

source: Enable %@
ja: %@を有効にする
zh_hans: 启用 %@
zh_hant: 啟用 %@

source: Edit %@
ja: %@を編集
zh_hans: 编辑 %@
zh_hant: 編輯 %@

source: Delete %@
ja: %@を削除
zh_hans: 删除 %@
zh_hant: 刪除 %@

source: %d messages · %@
ja: %d 件のメッセージ・%@
zh_hans: %d 条消息 · %@
zh_hant: %d 則訊息 · %@

source: Close Permission Helper
ja: 権限ヘルパーを閉じる
zh_hans: 关闭权限助手
zh_hant: 關閉權限輔助視窗

source: Dismisses the permission helper panel
ja: 権限ヘルパーパネルを閉じます
zh_hans: 关闭权限助手面板
zh_hant: 關閉權限輔助面板

source: Drag
ja: ドラッグ
zh_hans: 拖拽
zh_hant: 拖移

source: Accessibility
ja: アクセシビリティ
zh_hans: 辅助功能
zh_hant: 輔助使用

source: Input Monitoring
ja: 入力監視
zh_hans: 输入监控
zh_hant: 輸入監控

source: App Management
ja: アプリ管理
zh_hans: 应用管理
zh_hant: App 管理

source: Developer Tools
ja: 開発者ツール
zh_hans: 开发者工具
zh_hant: 開發者工具

source: Full Disk Access
ja: フルディスクアクセス
zh_hans: 完全磁盘访问权限
zh_hant: 完整磁碟存取權限

source: Media & Apple Music
ja: メディアとApple Music
zh_hans: 媒体与 Apple Music
zh_hant: 媒體與 Apple Music

source: Screen Recording
ja: 画面収録
zh_hans: 屏幕录制
zh_hant: 螢幕錄製

source: Check grammar
ja: 文法チェック
zh_hans: 语法检查
zh_hant: 文法檢查

source: Check shortcut
ja: チェック用ショートカット
zh_hans: 检查快捷键
zh_hant: 檢查快速鍵

source: Checked text is sent to the selected provider. Languages are detected automatically.
ja: チェックするテキストは選択したプロバイダーに送信されます。言語は自動検出されます。
zh_hans: 检查的文本会发送给所选服务商，语言将自动识别。
zh_hant: 檢查的文字會傳送給所選服務商，語言將自動辨識。

source: Choose…
ja: 選択…
zh_hans: 选择…
zh_hant: 選擇…

source: Enable SelectionBar in General to run grammar checks.
ja: 文法チェックを使うには「一般」でSelectionBarを有効にしてください。
zh_hans: 请在通用设置中启用 SelectionBar，以使用语法检查。
zh_hant: 請在一般設定中啟用 SelectionBar，以使用文法檢查。

source: English convention
ja: 英語の表記
zh_hans: 英语规范
zh_hant: 英語慣例

source: Grammar
ja: 文法
zh_hans: 语法
zh_hant: 文法

source: Select provider
ja: プロバイダーを選択
zh_hans: 选择服务商
zh_hant: 選擇服務商

source: Skip automatic checking in
ja: 自動チェックを行わないアプリ
zh_hans: 跳过以下应用的自动检查
zh_hant: 略過以下 App 的自動檢查

source: Unavailable provider
ja: 利用できないプロバイダー
zh_hans: 服务商不可用
zh_hant: 服務商無法使用
